Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: གཞན་ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་ངག་གི་ལས་ཐམས་ཅད་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་ཞིང་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་ངོ་། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ནི་འབྲས་བུ་ཡོད་པའི་ཆོས་སྟོན་པའོ། ། ཕྱད་པར་ལུང་སྟོན་པའོ། ། ཤིན་ཏུ་ངེས་པའི་ཚིག་སྨྲ་བའོ། ། དེ་བཞིན་གཤེགས་པའི་ངག་དེ་ཡང་ཀུན་ཤེས་པར་བྱེད་པ། རྣམ་པར་ཤེས་པར་བྱེད་པ། མི་མཐོ་བ། མི་དམའ་བ། མ་ཡོ་བ། འདར་འདར་པོ་མ་ཡིན་པ། གྱ་གྱུ་མེད་པ། མི་བརླང་བ། མི་རྩུབ་པ། གཟིང་གཟིང་བ་མ་ཡིན་པ། མཉེན་པ། ཡིད་དུ་འོང་བ། མ་འཆལ་བ། ལག་ལོག་མེད་པ། མི་འཚེ་བ། མི་མྱུར་བ། རབ་ཏུ་མྱུར་བ་མ་ཡིན་པ། ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ། ཤིན་ཏུ་ངེས་པའི་ཚིག ། རབ་ཏུ་མཉེན་པ། ཤིན་ཏུ་སྙན་པ། དབྱངས་སྙན་པ། རབ་ཏུ་གསལ་བ། བསྒྲགས་པ། དེས་པ། འཇམ་པ། ཕན་པ་དང་བཅས་པ། དགའ་བར་འགྱུར་བ། མཆོད་པར་འགྱུར་བ། མཛེས་པ། རྡུལ་མེད་པ་རྡུལ་དང་བྲལ་བ། ཐ་བ་མེད་པ། དྲི་མ་མེད་པ། མ་རྨོངས་པ། གསལ་བ། ཐོགས་པ་མེད་པ། ཡང་དག་པར་སྦྱོར་བ། འོད་གསལ་བ། དྲང་བ། འཇུངས་པ་མ་ཡིན་པ། དུམ་བུ་མ་ཡིན་པ། དིག་དིག་པོ་མ་ཡིན་པ། བདེ་བ་སྐྱེད་པ། ལུས་སིམ་པར་བྱེད་པ། སེམས་ཚིམ་པར་བྱེད་པ། འདོད་ཆགས་ཞི་བར་བྱེད་པ། ཞེ་སྡང་ཞི་བར་བྱེད་པ། གཏི་མུག་སེལ་བ། བདུད་འཇོམ་པ། སྡིག་པ་སེལ་བ། རྒོལ་བ་འདུལ་བ། གོ་བར་བྱེད་པ། རྔའི་སྒྲ་མཁས་པ་དགའ་བར་བྱེད་པ། ཀ་ལ་པིང་ཀའི་སྒྲ་དབྱངས། དབང་པོའི་སྒྲ། ཚངས་པའི་སྒྲ། རྒྱ་མཚོའི་རླབས་ཀྱི་སྒྲ། སྤྲིན་གྱི་སྒྲ། སའི་སྒྲ་དབྱངས། ཁྲུང་ཁྲུང་གི་སྒྲ། རྨ་བྱའི་སྒྲ་སྐད། ཁུ་བྱུག་གི་སྒྲ། ཤང་ཤང་ཏེའུའི་སྒྲ། ངང་པའི་སྒྲ་སྐད། རི་དགས་ཀྱི་རྒྱལ་པོའི་སྒྲ། ཁོང་ཧུ་དང་། པི་བང་དང་། འཁར་རྔ་དང་། དུང་དང་། སིལ་སྙན་རབ་ཏུ་བསྒྲགས་པའི་སྒྲ། ཀུན་ཤེས་པར་འགྱུར་བ། རྣམ་པར་ཤེས་པར་འགྱུར་བ། ཟུར་ཕྱིན་པ། ཡིད་དུ་འོང་བ། མཉན་པར་འོས་པ། ཟབ་པ། ལྐུགས་ཤིང་དིག་པ་མ་ཡིན་པ། བདེ་བ། དགེ་བའི་རྩ་བསྐྱེད་པ། ཚིག་དང་ཡི་གེ་མ་ཉམས་པ། ཤིན་ཏུ་ངེས་པར་སྨྲ་བ། ཚིག་འབྲུ་དང་། དོན་གྱི་ཚིག་དང་ལྡན་པ། ཆོས་ཀྱི་ཚིག་དང་ལྡན་པ། དུས་དང་ལྡན་པ། ཚོད་དང་ལྡན་པ། དུས་ལས་མི་འདའ་བ། དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་ཤེས་པས་བསྟན་པ། སྦྱིན་པས་བརྒྱན་པ། ཚུལ་ཁྲིམས་ཀྱིས་སྦྱང་པ། བཟོད་པས་བསྒྲུབས་པ། བརྩོན་འགྲུས་ཀྱིས་འབར་བར་བྱས་པ། བསམ་གཏན་གྱིས་ཡིད་དུ་འོང་བར་བྱས་པ། ཤེས་རབ་ཀྱིས་ངེས་པར་བརྟགས་པ། བྱམས་པས་ཤིན་ཏུ་བསགས་པ། སྙིང་རྗེས་མི་སྐྱོ་བ། དགའ་བས་འོད་གསལ་བ། བཏང་སྙོམས་ཀྱིས་ངེས་པར་བརྟགས་པ། ཐེག་པ་གསུམ་རྣམ་པར་འཇོག་པ། དཀོན་མཆོག་གསུམ་གྱི་རིགས་མི་གཅོད་པ། ཕུང་པོ་གསུམ་འཇོག་པ། རྣམ་པར་ཐར་པ་གསུམ་སྦྱོང་བ། བདེན་པ་ཡོངས་སུ་བསྒོམས་པ། ཡེ་ཤེས་ཡོངས་སུ་བསྒོམས་པ། མཁས་པས་མ་སྨད་པ། འཕགས་པས་བསྟོད་པ། ནམ་མཁའ་ཚད་མེད་པའི་རྗེས་སུ་སོང་བ། རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པའོ། ། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་ངག་ནི་དེ་འདྲ་སྟེ། དེ་ལྟ་བུར་དེ་བཞིན་གཤེགས་པའི་ངག་གི་ལས་ཐམས་ཅད་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་ཞིང་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བ་ཞེས་བྱ་སྟེ། ཤཱ་རིའི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅུ་བཞི་པའོ། །
en: “Moreover, Śāriputra, all the Tathāgata’s verbal activity is preceded by knowledge and accompanied by knowledge. How so? The instructions that the lords, the buddhas, give are not useless. His prophecies are not trite. His utterances are well articulated. The speech of the Tathāgata is informative, instructive, not haughty, not base, not evasive, not stuttering, not dishonest, not harsh, not rough, and not inaccessible. It is soft, desirable, not dull, not fickle, not oppressive, not hurried, not frantic, with correct pronunciation, articulate, beautiful, melodious, strong, clear, sonorous, friendly, sweet, helpful, delightful, honorable, splendid, immaculate, and clear. It is not defective, not confusing. It is glowing, unimpeded, coherent, illuminating, and straightforward. It is not feeble, not fragmented, not rattling. It brings joy. It leads to physical well-being. It leads to mental rapture. It pacifies desire. It pacifies anger. It eliminates confusion. It overcomes māras. It demolishes evil. It conquers opponents. It makes things known. It is the booming of drums. It delights the wise. It is like the sound of the song of the cuckoo, the sound of Indra, the sound of Brahmā, the sound of the waves of the ocean, the sound of clouds, the sound of the earth, the sound of the curlew, the sound of the cry of the peacock, the sound of the pheasant, the sound of geese, the sound of the swan, the roar of the king of beasts, the sound of the lute, the guitar, drums, the conch, or cymbals. It is informative, instructive, intelligible, charming, worth paying attention to, profound, and not like the mindless bleating of sheep. It is what gives rise to the root of happiness and to the wholesome. Words and expressions are uncorrupted. Sentences are well formulated. Words and meanings are related. The words conform with the Dharma. They are timely, relevant, and not excessive. He teaches, knowing whose abilities are adequate and whose are not. It is ornamented with generosity. It is purified by morality. It is accomplished through patience. It burns with vigor. It is made pleasant by concentration. It is fulfilled through wisdom. Its provisions are love. Its compassion is unwearied. It shines with empathetic joy. It is fulfilled through equanimity. It provides one with the three vehicles. It keeps the lineage of the Three Jewels unbroken. It establishes on the path the three types of sentient beings. It purifies the three liberations. It cultivates truth. It cultivates knowledge. It is blameless in the eyes of the wise. It is praised by the noble. It is as immeasurable as space. It is endowed with the best of all qualities. This, Śāriputra, is the nature of the Tathāgata’s speech, and this is why it is said that all the Tathāgata’s verbal activity is preceded by knowledge and accompanied by knowledge. This, Śāriputra, is the fourteenth of the Tathāgata’s unique buddha qualities.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་ཡིད་ཀྱི་ལས་ཐམས་ཅད་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་ཞིང་ཡེ་ཤེས་ཀྱི་རྗེས་སུ་འབྲང་བའོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་བཞིན་གཤེགས་པ་ནི་སེམས་ཀྱིས་བརྗོད་པ་མ་ཡིན། ཡིད་ཀྱིས་མ་ཡིན། རྣམ་པར་ཤེས་པས་མ་ཡིན་གྱི། དེ་བཞིན་གཤེགས་པ་ནི་ཡེ་ཤེས་ཀྱིས་རབ་ཏུ་ཕྱེ་བ་སྟེ། ཡེ་ཤེས་ཀྱི་དབང་དུ་གྱུར་པའོ། ། གང་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་དེ་ཡང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་རྗེས་སུ་སོང་བའོ། ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡིད་ཀྱི་རྗེས་སུ་འཇུག་པའོ། ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྣམ་པར་ཤེས་པ་ལས་རབ་ཏུ་དབེན་པའོ། ། ཆོས་ཐམས་ཅད་ལ་ངེས་པར་སེམས་པའོ། ། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་གཞན་གྱི་དྲིང་མི་འཇོག་པའོ། ། དམིགས་པ་ལས་ཤིན་ཏུ་འདས་པའོ། ། རྐྱེན་ལས་སྐྱེ་བ་དང་བྲལ་བའོ། ། སྲིད་པ་གསུམ་གྱི་འགྲོ་བ་སེལ་བའོ། ། ང་རྒྱལ་གྱི་རྣམ་པ་ཐམས་ཅད་ལས་ཤིན་ཏུ་འདས་པའོ། ། བདུད་ཀྱི་ལས་ཐམས་ཅད་ལས་ངེས་པར་གྲོལ་བའོ། ། སྒྱུ་དང་གཡོ་ཐམས་ཅད་དང་བྲལ་བའོ། ། ངར་འཛིན་པ་དང་། ང་ཡིར་འཛིན་པ་སྤངས་པའོ། ། མ་རིག་པ་དང་གཏི་མུག་གི་མུན་པ་དང་། ལིང་ཏོག་མེད་པའོ། ། ལམ་གྱི་ཡན་ལག་ཤིན་ཏུ་ཡོངས་སུ་བསྒོམས་པའོ། ། ནམ་མཁའ་དང་མཚུངས་ཤིང་རྣམ་པར་མི་རྟོག་པའོ། ། ཆོས་ཀྱི་དབྱིངས་དང་དབྱེར་མེད་པ་སྟེ། ཤཱ་རིའི་བུ་དེ་ལྟ་བུ་ནི་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བའི་ཡིད་ཀྱི་ལས་སོ། ། ཤཱ་རིའི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་ལྔ་པའོ། །
en: “Moreover, Śāriputra, all the Tathāgata’s mental activity is preceded by knowledge and accompanied by knowledge. How so? The Tathāgata does not express himself through his mind. It is not by means of mental capacity or consciousness that the Tathāgata expresses his knowledge, that he becomes the lord of knowledge. The knowledge of the Tathāgata can engage with the minds of all beings. It adapts to the mentalities of all beings. It is completely separate from the consciousness of all beings. It can reflect on all phenomena. In all concentrations, it is beyond the influence of others. It has transcended the idea of an object. It is free from conditioned arising. It is removed from the three forms of existence. It has transcended all forms of selfishness. It is liberated from all demonic patterns. It has left all illusion and deceit behind. It has abandoned all egoism and sense of possession. It is free of the cataracts of ignorance and confusion. It has fully cultivated the different aspects of the path. Like the heavens, it cannot be conceptualized. It is indivisible from the totality of phenomena. This, Śāriputra, is the way in which all the Tathāgata’s mental activity is preceded by knowledge, and this, Śāriputra, is the fifteenth of the Tathāgata’s unique buddha qualities.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་འདས་པའི་དུས་ལ་དེ་བཞིན་གཤེགས་པའི་མ་ཆགས་མ་ཐོགས་པའི་ཡེ་ཤེས་མཐོང་བ་འཇུག་གོ ། ཇི་ལྟར་འཇུག་ཅེ་ན། འདི་ལ་ཤཱ་རིའི་བུ་འདས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་བྱུང་བ་དང་། མ་བྱུང་བ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་བགྲང་བའི་ཚུལ་གྱིས་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པར་མཁྱེན་ཏོ། ། སངས་རྒྱས་ཀྱི་ཞིང་ཇི་སྙེད་པ་དེའི་རྩྭ་དང་། ཤིང་གེལ་བ་དང་། སྨན་དང་། ནགས་ཚལ་བྱུང་བ་དེ་དག་ཐམས་ཅད་རབ་ཏུ་མཁྱེན་ཏོ། ། སངས་རྒྱས་ཀྱི་ཞིང་ཇི་སྙེད་པ་དེའི་སེམས་ཅན་གྱི་ཚོགས་སེམས་ཅན་དུ་གཏོགས་པ་བྱུང་བ་དེ་དག་ཐམས་ཅད་རབ་ཏུ་མཁྱེན་ཏོ། ། དེ་དག་ན་སེམས་ཅན་སྣ་ཚོགས་བྱུང་བ་ཇི་སྙེད་པ་གཟུགས་ཐ་དད་པ་ལ་སོགས་པ་རྒྱས་པར་བྱ་སྟེ། སངས་རྒྱས་བྱུང་བ་ཇི་སྙེད་པ་དང་། དེ་བཞིན་གཤེགས་པ་རེ་རེས་ཆོས་བསྟན་ཅིང་བརྗོད་པ་ཇི་སྙེད་པ་ཡང་གོང་མ་བཞིན་དུ་སྦྱར་རོ། ། སེམས་ཅན་ཇི་སྙེད་ཅིག་ཉན་ཐོས་ཀྱི་ཐེག་པས་བཏུལ་བ་དང་། ཇི་སྙེད་ཅིག་རང་སངས་རྒྱས་ཀྱི་ཐེག་པས་བཏུལ་བ་ཡང་གོང་མ་བཞིན་དུ་སྦྱར་ཏེ། སངས་རྒྱས་ཀྱི་ཞིང་རྣམ་པར་ཕྱེ་བ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། ། དགེ་སློང་གི་དགེ་འདུན་རྣམ་པར་ཕྱེ་བ་དང་། ཚེའི་ཚད་རྣམ་པར་ཕྱེ་བ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། ། ཆོས་གནས་པ་རྣམ་པར་ཕྱེ་བ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། ། དབུགས་ཕྱི་ནང་དུ་རྒྱུ་བ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། ། ཟས་ཀྱི་མཆོག་གི་ལོངས་སྤྱོད་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་འདས་པའི་རྣམ་པ་དང་། ཤི་འཕོ་བ་དང་། སྐྱེ་བ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། ། དབང་པོ་ཐ་དད་པ་དང་། སྤྱོད་པ་ཐ་དད་པ་དང་། བསམ་པ་ཐ་དད་པའང་རབ་ཏུ་མཁྱེན་ཏོ། ། སེམས་ཀྱི་རྒྱུད་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། ། སེམས་གང་གི་འོག་ཏུ་སེམས་གང་འབྱུང་བ་དེ་དག་ཐམས་ཅད་ཀྱང་བགྲང་བའི་ཚུལ་གྱིས་མངོན་སུམ་དུ་ཡེ་ཤེས་དང་། རྗེས་སུ་འགྲོ་བའི་ཡེ་ཤེས་ཀྱིས་རབ་ཏུ་མཁྱེན་ཏེ། དེ་བཞིན་གཤེགས་པ་ལ་འདས་པར་གཏོང་བའི་སེམས་ཀྱི་རྒྱུད་ཀྱང་མི་དམིགས་ཏེ། དེ་བཞིན་གཤེགས་པ་ནི་དེ་ལྟ་བུའི་ཡེ་ཤེས་དང་ལྡན་པས་སེམས་ཅན་གྱི་བསམ་པ་ལ་ཉམས་པ་མེད་པར་ཆོས་སྟོན་ཏེ། ཤཱ་རིའི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅུ་དྲུག་པའོ། །
en: “Moreover, Śāriputra, the Tathāgata’s vision of knowledge has unimpeded and unobstructed access to the past. How does it have this unimpeded access? Śāriputra, whatever may or may not have occurred in the past, the Tathāgata knows these buddha fields and is able to recount them. Whatever may have occurred within these buddha fields, manifesting as grass, bushes, herbs, and woods, he is aware of it all. Whatever may have occurred within these buddha fields, manifesting as the bodies of sentient beings and labeled as sentient beings, he is aware of it all. Whatever may have occurred within the buddha fields of various kinds of beings, in various forms, he is aware of it all. However many buddhas may have appeared, however many teachings on the Dharma each of these tathāgatas may have delivered, he is aware of them all. However many beings may have gone through the training of the Śrāvakayāna, and however many may have gone through the training of the Pratyekabuddhayāna, he is aware of them all. He has detailed knowledge of the buddha fields. He has detailed knowledge of the community of mendicants. He has detailed knowledge of the lifespans of sentient beings, and he has detailed knowledge of the bases of phenomena. He understands the process of inhalation and exhalation. He understands the pleasures of enjoying good food. The Tathāgata knows the processes of death and rebirth of every being in the past. He knows their various abilities, their various forms of conduct, and their various inclinations. He knows their mental continua. He knows and is able to recount the states of mind that are continuous and the states of mind that arise. His knowledge stems from direct perception and from inference. One cannot find any mental patterns governed by the past in the Tathāgata. Such is the knowledge with which the Tathāgata teaches the Dharma faultlessly, adjusted to the inclinations of sentient beings. This, Śāriputra, is the sixteenth of the Tathāgata’s unique buddha qualities.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་མ་འོངས་པའི་དུས་ལ་དེ་བཞིན་གཤེགས་པའི་མ་ཆགས་མ་ཐོགས་པའི་ཡེ་ཤེས་མཐོང་བ་འཇུག་གོ ། མ་འོངས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་གང་དག་འབྱུང་བ་དང་། འགོག་པ་དང་། འབྱུང་བར་འགྱུར་བ་དང་། འབྱུང་བར་མི་འགྱུར་བ་ཐ་དད་པ་དེ་དག་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། ། བསྐལ་པ་མེས་ཚིག་པར་འགྱུར་བ་ཇི་སྙེད་པ་དང་། ཆུས་སྡུད་པར་འགྱུར་བ་ཇི་སྙེད་པ་དང་། རླུང་གིས་སྡུད་པར་འགྱུར་བ་ཇི་སྙེད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གནས་པར་འགྱུར་བ་ཇི་སྙེད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་སའི་ཁམས་ཇི་སྙེད་པ་དང་། རྡུལ་ཕྲ་རབ་ཇི་སྙེད་པ་དང་། རྩྭ་དང་། ཤིང་གེལ་པ་དང་། སྨན་དང་། ནགས་ཚལ་ཇི་སྙེད་འབྱུང་བར་འགྱུར་བ་དང་། སྐར་མའི་གཟུགས་ཇི་སྙེད་འབྱུང་བར་འགྱུར་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་རབ་འབྱམ་རེ་རེ་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཇི་སྙེད་འབྱུང་བར་འགྱུར་བ་དང་། རང་སངས་རྒྱས་ཇི་སྙེད་འབྱུང་བར་འགྱུར་བ་དང་། ཉན་ཐོས་ཇི་སྙེད་འབྱུང་བར་འགྱུར་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཇི་སྙེད་འབྱུང་བར་འགྱུར་བ་དང་། ཟས་ཀྱི་ལོངས་སྤྱོད་དང་། དབུགས་ཕྱི་ནང་དུ་རྒྱུ་བ་དང་། འཆག་པ་དང་། འདུག་པ་དང་། སྤྱོད་ལམ་ཇི་སྙེད་འབྱུང་བར་འགྱུར་བ་དང་། དེ་བཞིན་གཤེགས་པ་རབ་འབྱམ་རེ་རེ་ལས་སེམས་ཅན་ཇི་སྙེད་ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པས་རྣམ་པར་ཐར་པར་འགྱུར་བ་དང་། སེམས་ཅན་ཇི་སྙེད་ཐེག་པ་ཆེན་པོས་རྣམ་པར་ཐར་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། ། སངས་རྒྱས་ཀྱི་ཞིང་རབ་འབྱམ་རེ་རེ་ན་སེམས་ཅན་སྐྱེ་བའི་གནས་ཇི་སྙེད་འབྱུང་བར་འགྱུར་བ་དང་། སེམས་དང་སེམས་ལས་བྱུང་བ་སྐྱེ་བ་དང་། སྐྱེ་བར་འགྱུར་བ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། ། དེ་ལྟར་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཀྱང་དེ་བཞིན་གཤེགས་པ་མ་འོངས་པའི་སེམས་ཀྱི་རྒྱུད་བསྐལ་པར་འགྱུར་བ་མ་ཡིན་ཏེ། དེ་བཞིན་གཤེགས་པའི་མ་འོངས་པ་ལ་གཟིགས་པས་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏེ། ཤཱ་རིའི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅུ་བདུན་པའོ། །
en: “Moreover, Śāriputra, the Tathāgata’s vision of knowledge has unimpeded and unobstructed access to the future. The Tathāgata knows all the tathāgatas who in the future will appear or disappear, who will come into existence or not come into existence. The Tathāgata knows the fires that will burn at the end of an eon, the waters that will churn and the winds that will rage. He knows the buddha fields that will manifest, the earth element that will be present within these buddha fields, the minute particles of dust that will exist, and the grass, bushes, herbs, and woods that will grow there. He knows the constellations of stars that will be there. He knows the lords, the buddhas, who will appear in the buddha fields, each and every one. He knows the pratyekabuddhas, the śrāvakas, and the bodhisatvas who will appear. He knows the edible enjoyments, the in-breaths and the out-breaths, the journeys, the dwellings, and the spiritual practices that will appear. He knows the sentient beings who, being within the vast range of influence of any of the many tathāgatas, will be liberated through the Pratyekabuddhayāna or the Śrāvakayāna, and he knows the sentient beings who will be liberated through the Mahāyāna. He knows all this. He knows the places, the buddha fields—each and every one—where sentient beings will take birth, and the minds and mental states that appear and will appear. The Tathāgata knows all this. Even though the Tathāgata knows all this, the Tathāgata’s future mental stability is not disturbed. With this insight into the future, the Tathāgata teaches sentient beings. This, Śāriputra, is the seventeenth of the Tathāgata’s unique buddha qualities.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་ད་ལྟར་གྱི་དུས་ལ་དེ་བཞིན་གཤེགས་པའི་མ་ཆགས་མ་ཐོགས་པའི་ཡེ་ཤེས་མཐོང་བ་འཇུག་གོ ། ཇི་ལྟར་འཇུག་ཅེ་ན། འདི་ལ་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ད་ལྟར་གྱི་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་བགྲང་བའི་ཚུལ་རྣམ་པ་གསུམ་གྱིས་རབ་ཏུ་མཁྱེན་ཏོ། ། ད་ལྟར་གྱི་ཆོས་ཐམས་ཅད་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། ། ད་ལྟར་གྱི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་། དེ་བཞིན་དུ་ད་ལྟར་གྱི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། ། ད་ལྟར་གྱི་སྐར་མའི་གཟུགས་ཐམས་ཅད་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། ། ད་ལྟར་གྱི་རྩྭ་དང་། ཤིང་གེལ་བ་དང་། སྨན་དང་། ནགས་ཚལ་ཐམས་ཅད་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། ། ད་ལྟར་གྱི་ཕྱོགས་བཅུའི་སའི་ཁམས་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་གྱི་ཆར་བརླགས་པ་ཐམས་ཅད་ཀྱང་བགྲང་བའི་ཚུལ་གྱིས་རབ་ཏུ་མཁྱེན་ཏོ། ། ཕྱོགས་བཅུའི་ཆུའི་ཁམས་སྐྲའི་རྩེ་མོས་བླངས་པའི་ཐིགས་པ་ཐམས་ཅད་ཀྱང་བགྲང་བའི་ཚུལ་གྱིས་རབ་ཏུ་མཁྱེན་ཏོ། ། ཕྱོགས་བཅུའི་མེའི་ཁམས་ཀྱི་འོད་འཕྲོ་བ། སྐྱེས་པ་དང་། འགགས་པ་ཐམས་ཅད་ཀྱང་བགྲང་བའི་ཚུལ་གྱིས་རབ་ཏུ་མཁྱེན་ཏོ། ། ཕྱོགས་བཅུའི་རླུང་གི་ཁམས་ཐམས་ཅད་ཀྱང་གཟུགས་ཀྱི་ཁམས་སྒྲུབ་པ་བགྲང་བའི་ཚུལ་གྱིས་རབ་ཏུ་མཁྱེན་ཏོ། ། ཕྱོགས་བཅུའི་ནམ་མཁའི་ཁམས་ཐམས་ཅད་སྐྲའི་རྩེ་མོའི་ཆ་ཤས་ཀྱིས་བགྲང་བའི་ཚུལ་གྱིས་རབ་ཏུ་མཁྱེན་ཏོ། ། ད་ལྟར་གྱི་སེམས་ཅན་གྱི་ཁམས་རྣམ་པ་གསུམ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། ། ད་ལྟར་གྱི་སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་གྱི་ཁམས་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། ། དེའི་སྐྱེ་བའི་རྒྱུ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། ། ལྡང་བའི་རྒྱུ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། ། ད་ལྟར་གྱི་དུད་འགྲོའི་སྐྱེ་གནས་སུ་སོང་བའི་སེམས་ཅན་གྱི་ཁམས་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། ། དེའི་སྐྱེ་བའི་རྒྱུ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། ། ལྡང་བའི་རྒྱུ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། ། ད་ལྟར་གྱི་གཤིན་རྗེའི་འཇིག་རྟེན་པའི་སེམས་ཅན་གྱི་ཁམས་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། ། དེའི་སྐྱེ་བའི་རྒྱུ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། ། ལྡང་བའི་རྒྱུ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། ། ད་ལྟར་གྱི་མིའི་སེམས་ཅན་གྱི་ཁམས་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། ། དེའི་སྐྱེ་བའི་རྒྱུ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། ། ད་ལྟར་གྱི་ལྷའི་སེམས་ཅན་གྱི་ཁམས་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། ། དེའི་སྐྱེ་བའི་རྒྱུ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། ། ད་ལྟར་གྱི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་རྒྱུད་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། ། དེ་དག་གི་ཉོན་མོངས་པ་དང་བཅས་པ་འང་རབ་ཏུ་མཁྱེན་ཏོ། ། ཉོན་མོངས་པ་དང་བྲལ་བ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། ། ད་ལྟར་གྱི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འདུལ་བའི་དབང་པོ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། ། འདུལ་བ་མ་ཡིན་པའི་དབང་པོ་ཡང་རབ་ཏུ་མཁྱེན་ཏོ། ། དེ་ལྟར་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཀྱང་། དེ་བཞིན་གཤེགས་པ་ལ་གཉིས་ཀྱི་རྗེས་སུ་འབྲང་བའི་རྣམ་པར་ཤེས་པ་མེད་དེ། གཉིས་སུ་མེད་པ་ལ་ཞུགས་པའི་ཕྱིར། སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་ཏེ། ཤཱ་རིའི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་པའོ། །
en: “Moreover, Śāriputra, the Tathāgata’s vision of knowledge has unimpeded and unobstructed access to the present. How does it have this unimpeded access? Śāriputra, the Tathāgata knows the buddha fields in the ten directions in the present by means of three ways of counting. He knows all present phenomena. He knows all present bodhisatvas, as well as the śrāvakas and pratyekabuddhas of the present. He knows every present constellation of stars. He knows every present blade of grass, shrub, herb, and wood. He knows and can recount the whole present earth element in the ten directions down to the most finely crushed particles of dust. He knows and can recount the whole water element down to the tiniest drop of water as small as a hair’s breadth. He knows and can recount the whole fire element, flames that ignite and go out. He knows and can recount the whole wind element, which makes the realm of form effective. He knows and can recount in minute detail the whole space element. He knows the diverse present realm of living beings. He knows the present realm of hell. He knows what causes one to be born there, and he knows what causes one to leave that state. He knows the present realm of animals. He knows what causes one to be born there, and he knows what causes one to leave that state. He knows the present spirit world governed by Yama. He knows what causes one to be born there, and he knows what causes one to leave that state. He knows the present realm of human beings, and he knows what causes death there. He knows the present realm of the gods. He knows what causes one to be born there, and he knows what causes death there. He knows the present mental continua of all sentient beings. He knows their states of affliction. He knows the state that is free from afflictions. He knows all the present sentient beings who can be trained, and he knows those who cannot be trained. This is what the Tathāgata knows, and still the Tathāgata does not entertain any notions of duality. Remaining in nonduality, he teaches the Dharma to all sentient beings. This, Śāriputra, is the eighteenth of the Tathāgata’s unique buddha qualities.

source: ཤཱ་རིའི་བུ་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་པོ་དེ་དག་དང་ལྡན་པས། དེ་བཞིན་གཤེགས་པ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་རབ་འབྱམ་མ་ལུས་པ་ཐམས་ཅད་དུ་འཁོར་གྱི་ནང་དུ་གཟི་བརྗིད་དང་། གྲགས་པ་དང་། དཔལ་དང་། ངོ་མཚར་དང་། རྨད་དུ་བྱུང་བའི་ཆོས་ཉིད་ཀྱིས་འཁོར་རྣམས་ཟིལ་གྱིས་མནན་ནས་ལམ་མེ། ལྷན་ནེ། ལྷང་ངེའོ། ། དེ་ལྟར་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་མཐའ་ཡས་མུ་མེད་དོ། ། འདི་ལྟ་སྟེ། ཤཱ་རིའི་བུ་ནམ་མཁའ་མཐའ་ཡས་མུ་མེད་པ་དེ་བཞིན་དུ། དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ཡང་མཐའ་ཡས་མུ་མེད་དོ། ། གང་དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་མཐའ་འདོད་པ་དེ་ནི་ནམ་མཁའི་མཐའ་འདོད་དོ། ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པའི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་དེ་དག་ཐོས་ནས་མངོན་པར་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག ། སོམ་ཉི་མེད། ཐེ་ཚོམ་མི་ཟ། རྒྱ་ཆེར་དགའ་མགུ་སྟེ། རངས་པ་རྙེད་ཅིང་ནམ་མཁའ་ལྟ་བུར་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར་ངོ་མཚར་དང་རྨད་དུ་འདུ་ཤེས་སྐྱེད་དོ། །
en: “These, Śāriputra, are the eighteen unique buddha qualities that the Tathāgata possesses and with which he completely overwhelms his surroundings with fiery, magnificent, glorious, wondrous and extraordinary true qualities, glowing, glittering and shining as he travels throughout all the vast worlds in the ten directions. Śāriputra, these eighteen unique buddha qualities are therefore boundless. Śāriputra, just as space is boundless, so, too, are these unique buddha qualities of the Tathāgata boundless. Śāriputra, if one could claim that there is a limit to space, then one could also claim that there is a limit to the unique buddha qualities of the Tathāgata. When the bodhisatva, the great being, learns of these unique buddha qualities of the Tathāgata, he develops great faith, trust, and confidence, and he has no uncertainty or doubt about them. They bring him pleasure, joy, and satisfaction, and as these qualities are as inconceivable as space he considers them to be truly wondrous and extraordinary.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་བདེ་བར་གཤེགས་པས་དོན་འདི་བཀའ་སྩལ་ནས། སྟོན་པ་ཡང་འདི་སྐད་གསུང་ངོ་། །
en: This is what the Lord said. After the Sugata had said this, he, the teacher, continued as follows:

source: འདྲེན་པ་ལ་ནི་འཁྲུལ་པ་ཡོང་མེད་དེ། །
en: “The leader is without error,

source: ལུས་དང་ངག་རྣམས་དང་ནི་སེམས་མི་གཡོ། །
en: Unshakable in body, speech, and mind.

source: དེ་བཞིན་སྲོག་ཆགས་རྣམས་ལ་ཆོས་སྟོན་ཏེ། ། དེ་ནི་རྒྱལ་བ་རྣམས་ཀྱི་མ་འདྲེས་ཆོས། །
en: In this way, he teaches the Dharma to all living beings. This is one of the leader’s unique qualities.

source: ཁེངས་པར་མི་འགྱུར་འདུད་པར་མི་འགྱུར་ཏེ། །
en: “He does not become haughty or depressed.

source: ཁོང་ཁྲོ་རྗེས་སུ་ཆགས་ལས་མངོན་པར་འདས། །
en: He has overcome attraction and aversion.

source: ཉོན་མོངས་མེད་ལ་གནས་ཤིང་ཉོན་མོངས་གྲོལ། །
en: He is unconflicted, free from strife.

source: དེ་ནི་རྒྱལ་བ་རྣམས་ཀྱི་མ་འདྲེས་ཆོས།
en: This is one of the leader’s unique qualities.

source: །འདྲེན་པ་ལ་ནི་དྲན་པ་བསྙེལ་བ་མེད། །
en: “The leader does not lose his awareness.

source: རྣམ་ཐར་སྤྱོད་ཡུལ་ཆོས་ནི་མངོན་པར་མཁྱེན། །
en: He knows the dharmas, the domain of liberation, in full.

source: སོ་སོ་ཡང་དག་རིག་པ་བསྙེལ་མེད་དེ། །
en: He does not lose his analytical abilities.

source: དེ་ནི་རྒྱལ་བ་རྣམས་ཀྱི་མ་འདྲེས་ཆོས། །
en: This is one of the leader’s unique qualities.

source: མཉམ་པར་གཞག་པས་བཞུགས་ཤིང་བཤོས་ཀྱང་གསོལ། །
en: “He maintains his focus.

source: འཆག་དང་མནལ་བ་ན་ཡང་མཉམ་པར་གཞག །
en: He is focused whether he is eating, walking, or sleeping.

source: གཡེང་བ་མེད་ཅིང་སེམས་ཅན་འདུ་ཤེས་མེད། །
en: He is not disturbed, and his perception is not like that of sentient beings.

source: །རྒྱལ་བ་དང་ནི་ཞིང་དང་སེམས་ཅན་ལ། །ཐ་དད་འདུ་ཤེས་བདེ་བར་གཤེགས་ལ་མེད། །
en: “The Sugata does not differentiate Between universes, beings, and victorious ones

source: བསམ་པ་ཆེན་པོ་མཉམ་པ་ཉིད་ལ་གནས། །
en: But has the same great intentions in all circumstances.

source: དེ་དག་ལ་ནི་མ་བརྟགས་བཏང་སྙོམས་མེད། །
en: “His disinterestedness toward them is well considered.

source: ཤིན་ཏུ་ངེས་པའི་ལམ་ནི་རབ་བསྒོམས་པས།
en: He cultivates the path of definitive certainty

source: །དེ་ལ་རྟོག་དང་རྣམ་པར་རྟོག་མེད་དེ། །
en: And remains of from opinions and judgements.

source: །དགེ་བ་ལ་ནི་འདུན་པ་ཉམས་པ་མེད། །
en: “His zeal for what is wholesome is never given up.

source: སྟོན་པ་རྟག་ཏུ་སྙིང་རྗེ་རབ་སྦྱོར་ཞིང་།
en: Out of compassion, the teacher is always continually engaged

source: །སེམས་ཅན་རྒྱ་ཆེན་དཔག་ཏུ་མེད་པ་འདུལ།
en: In training the unlimited expanse of beings.

source: །དེ་ནི་རྒྱལ་བ་རྣམས་ཀྱི་མ་འདྲེས་ཆོས།
en: This is one of the leader’s unique qualities.

source: །ནམ་ཡང་བརྩོན་འགྲུས་ལ་ནི་ཉམས་པ་མེད། །
en: “His vigor never deteriorates,

source: འདུལ་བ་མཐའ་དང་ཕ་རོལ་མེད་མཐོང་ནས། །
en: Even when he sees that those to be trained are innumerable.

source: ལུས་དང་ངག་རྣམས་དང་ནི་ཡིད་ཀྱིས་འདུལ།
en: He trains them by means of body, speech, and mind.
